//
// Created by Ivana Stojkoska on 15.6.2026.
//

/*
Од тастатура се внесува цел број X. Да се напише програма што ќе провери дали бројот X може да се претстави како збир на
два цели броја (a + b = X), така што за секој од броевите a и b важи следново: апсолутната разлика меѓу секои две соседни цифри
во бројот е еднаква на 1 (на пример: 12, 21, 232, 3434, 10). Се претпоставува дека секој од броевите a и b има најмалку две цифри.
Ако за внесениот број X постојат такви парови (a, b) броеви (барем еден), програмата ги печати сите што го исполнуваат условот
во растечки редослед според првиот број од парот и на крај печати „Yes“.
Паровите (a, b) и (b, a) се сметаат како ист пар и треба да се испечати само еден од нив (само парот (a, b)).
Ако не постои ниту еден таков пар, програмата печати „No“.

Влез:
66

Излез:
(10, 56)
(12, 54)
(21, 45)
(23, 43)
(32, 34)
Yes
 */
#include <iostream>
using namespace std;

bool absrazl(int n) {
    bool is = true;

    if (n < 10) return false;

    while (n > 9) {
        int ld = n % 10;
        int sld = n % 100 / 10;
        if (abs(ld - sld) != 1) {
            is = false;
            return false;
        }
        n /= 10;
    }
    return true;
}


int main() {
    int x;
    cin >> x;

    cout << absrazl(3434);
    bool found = false;
    for (int i = 0; i < x / 2; i++) {
        if (absrazl(i) == 1 && absrazl(x - i) == 1) {
            if (i + (x - i) == x) {
                found = true;
                cout << "(" << i << ", " << x - i << ")" << endl;
            }
        }
    }

    if (found) {
        cout << "Yes";
    } else {
        cout << "No";
    }

    return 0;
}
